# DisableTemporaryViewMode Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..DisableTemporaryViewMode Method
View Class See Also
---
Disables the specified temporary view mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void DisableTemporaryViewMode(
	TemporaryViewMode mode
)
```

Visual Basic
---
```text
Public Sub DisableTemporaryViewMode ( _
	mode As TemporaryViewMode _
)
```

Visual C++
---
```text
public:
void DisableTemporaryViewMode(
	TemporaryViewMode mode
)
```

# ### Parameters
mode
    Type: Autodesk.Revit.DB..::..TemporaryViewMode The mode to disable.
# Remarks
Has no effect if the mode is already disabled.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | View cannot use temporary visibility modes. |

# See Also
View Class
Autodesk.Revit.DB Namespace